matrix = [[20, 21, 32, 24],
          [25, 26, 37, 18],
          [19, 10, 11, 12],
          [13, 14, 15, 16],
          [17, 18, 19, 20],
          [21, 22, 23, 24],
          [25, 26, 27, 28],
          [29, 30, 31, 32],
          [33, 34, 35, 36],
          [37, 38, 39, 40],
          [41, 42, 43, 44]]


def sm(m, n):  # функция подсчитывающая общее число учеников в параллели и возвращающая их сумму
    num = 0
    for i in matrix[n-1]:
        num = num + i
    return num


c = 0
for row in matrix:
    c += 1
    print(*row, "[", c, "класс ]")

print()
print("Общее число учеников в параллели 5-х  и 10-х классов:", (sm(matrix, 5) + sm(matrix, 10))) # Вывод суммы параллели 5-х и 10-х классов